/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : AuxDevMsg.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 电池组与辅助设备通信CAN报文处理模块
** @Instructions : 
**===============================================================================================*/
#ifndef _AUXDEVMSG_H
#define _AUXDEVMSG_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"
#include "GroupInfo.h"


/*=================================================================================================
** @Macro definition
**===============================================================================================*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : void CanRcvImeu2MsgHandle_API(u32 ID, u8 *pdata, u8 DLC, u8 canNum)
** @Input     : ID:CANID *pdata:CAN数据域  DLC:数据域长度 canNum:CAN通道号
** @Output    : void
** @Function  : CAN通信IMEU2接收处理任务
** @The notes : 用户放在CAN接收处理HOOK接口调用
**===============================================================================================*/
void CanRcvImeu2MsgHandle_API(u32 ID, u8 *pdata, u8 DLC, u8 canNum);

/*=================================================================================================
** @Name      : void SendCanImeu2SelfCtrlMsg220(u8 index, u8 cmd)
** @Input     : index:控制索引 cmd:控制命令
** @Output    : void
** @Function  : 发送IMEU2用户自定义控制信息CAN报文
** @The notes : 主索引220
**===============================================================================================*/
void SendCanImeu2SelfCtrlMsg220(u8 index, u8 cmd);

/*=================================================================================================
** @Name      : void SendCanImeu2AirCtrlMsg221(u8 index, s8 cmd)
** @Input     : index:控制索引 cmd:控制命令或设置参数值
** @Output    : void
** @Function  : 发送IMEU2空调控制和参数设置信息CAN报文
** @The notes : 主索引221
**===============================================================================================*/
void SendCanImeu2AirCtrlMsg221(u8 index, s8 cmd);

#endif
