/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : AuxDevTactic.c
** @Founder      : ZSY342
** @Date         : 2019.10.30
** @Function     : 辅助设备控制策略模块
** @Instructions :
**===========================================================================================*/
#ifndef _AUXDEVTACTIC_H
#define _AUXDEVTACTIC_H

/*=============================================================================================
** @Header file definition
**===========================================================================================*/

/*=============================================================================================
** @Macro definition
**===========================================================================================*/
#define IMEU2_SHUTFAN_CTRL_T        (10)    /*IMEU2百叶风机控制(状态改变)必须间隔时间,1s(默认10s)*/
#define IMEU2_SHUTFAN_VENT_T        (120)   /*IMEU2百叶风机通风开启时长,1s(默认60s)*/
#define IMEU2_SHUTFAN_WAIT_T        (30)    /*IMEU2百叶风机通风间隔时长,1天(默认30天)*/

#define IMEU2_AIR_STATE_T           (900)   /*IMEU2空调状态持续至少时长,1s(默认15min)*/
#define IMEU2_AIR_CYCLE_T           (300)   /*IMEU2空调控制检测周期时长,1s(默认5min)*/
#define IMEU2_AIR_CTRL_T            (180)   /*IMEU2空调控制命令持续时长,1s(默认3min)*/

#define IMEU2_AIR_FORCMD_EN         (0)     /*IMEU2空调强制控制使能(强制制冷或制热模式,默认禁止)*/
#define IMEU2_AIR_ERRPRO_EN         (0)     /*IMEU2空调故障保护使能(空调故障关闭空调,默认禁止)*/
#define IMEU2_AIR_HT_WARN_T         (60)    /*IMEU2空调默认内部过温报警温度,1℃(30~60℃,默认60℃)*/
#define IMEU2_AIR_LT_WARN_T         (-30)   /*IMEU2空调默认内部低温报警温度,1℃(-45~10℃,默认-30℃)*/
#define IMEU2_AIR_COLD_MIN_T        (18)    /*IMEU2空调默认制冷限制最低温度,1℃(16~30℃,默认18℃)*/
//#define IMEU2_AIR_COLD_ON_T       (23)    /*IMEU2空调默认制冷设定温度[制冷停止温度](制冷关闭温度),1℃(16~38℃,默认23℃)*/
//#define IMEU2_AIR_COLD_OFF_T      (5)     /*IMEU2空调默认制冷偏移温度(制冷开启回差温度),1℃(1~10℃,默认5℃)*/
//#define IMEU2_AIR_HEAT_ON_T       (8)     /*IMEU2空调默认制热设定温度[制热开启温度](制热停止温度),1℃(5~26℃,默认8℃)*/
//#define IMEU2_AIR_HEAT_OFF_T      (7)     /*IMEU2空调默认制热偏移温度(制热开启回差温度),1℃(1~10℃,默认7℃)*/
//#define IMEU2_AIR_DEH_ON_T        (20)    /*IMEU2空调默认开启除湿温度[即除湿加热开启温度,建议低于制冷设定温度],1℃(20~40℃,默认20℃)*/
//#define IMEU2_AIR_DEH_OFF_T       (25)    /*IMEU2空调默认停止除湿温度[即除湿加热停止温度,建议低于制冷设定温度],1℃(20~45℃,默认25℃)*/
//#define IMEU2_AIR_DEH_ON_H        (80)    /*IMEU2空调默认开启除湿湿度,1%(50~99%,默认80%)*/
//#define IMEU2_AIR_DEH_OFF_H       (75)    /*IMEU2空调默认停止除湿湿度,1%(45~95%,默认75%)*/
//#define IMEU2_AIR_HH_WARN_H       (96)    /*IMEU2空调默认高湿报警湿度,1%(50~100%,默认96%)*/

/*=============================================================================================
** @Data type definition
**===========================================================================================*/
/*辅助设备控制异常标志位*/
typedef enum
{
    eAuxErr_ShutOn  = 0,                /*bit0:开启百叶异常 */
	eAuxErr_FanOn   = 1,                /*bit1:开启风机异常*/
	eAuxErr_AirWarn = 2,                /*bit2:空调告警*/
	eAuxErr_ShutOff = 8,                /*bit8:关闭百叶异常*/
	eAuxErr_FanOff  = 9,                /*bit9:关闭风机异常*/
	eAuxErr_AirCom  = 10,               /*bit10:空调通信中断*/

	eAuxErr_BitLen
}e_AuxErrBit;

/*辅助设备通信异常标志位*/
typedef enum
{
    eAuxComErr_Air  = 0,                /*bit0:空调 */
	eAuxComErr_TH1  = 1,                /*bit1:温湿度传感器1*/
	eAuxComErr_TH2  = 2,                /*bit2:温湿度传感器2*/
	eAuxComErr_TH3  = 3,                /*bit3:温湿度传感器3*/
	eAuxComErr_Gas1 = 4,                /*bit4:气体传感器1*/
	eAuxComErr_Gas2 = 5,                /*bit5:气体传感器2*/
	eAuxComErr_Gas3 = 6,                /*bit6:气体传感器3*/

	eAuxComErr_BitLen
}e_AuxComErrBit;
/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/
/*=============================================================================================
** @Name      : void TacAuxDevManagTask(void)
** @Input     : void
** @Output    : void
** @Function  : 辅助板管理任务
** @The notes : 500ms驱动1s周期
**===========================================================================================*/
void TacAuxDevManagTask(void);

/*使能IMEU2通信交互*/
#if(1 == BMU_IMEU_COM_EN)
/*=============================================================================================
** @Name      : void TacSetAuxDevAirTypeAPI(u8 type)
** @Input     : flag:空调类型 0:黑盾 1:同飞
** @Output    : void
** @Function  : 设置空调类型
** @The notes :
**===========================================================================================*/
void TacSetAuxDevAirTypeAPI(u8 type);

/*=================================================================================================
** @Name      : void TacRcvImeuMsgAddAPI(u8 addr)
** @Input     : addr:设备地址
** @Output    : void
** @Function  : 接收IMEU2通信信息地址数目计数
** @The notes : 接收到IMEU2报文时调用
**===============================================================================================*/
void TacRcvImeuMsgAddAPI(u8 addr);
#endif

/*=============================================================================================
** @Name      : void TacSetPwmFanUserCmdAPI(u8 id, u8 duty)
** @Input     : id:[0,15]:风扇ID(电池箱序号),0xff:所有风扇  duty:控制转速占空比[0,100]1%
** @Output    : void
** @Function  : 设置电池箱调速风扇用户控制命令
** @The notes : 1个电池箱1路风扇(IMLU1控制)
**===========================================================================================*/
void TacSetPwmFanUserCmdAPI(u8 id, u8 duty);

/*=============================================================================================
** @Name      : void TacSetAuxShutUserCmdAPI(u8 cmd)
** @Input     : void
** @Output    : 百叶风机用户控制命令(0:关闭 1:开启)
** @Function  : 设置百叶风机用户控制命令
** @The notes : IMEU2控制
**===========================================================================================*/
void TacSetAuxShutUserCmdAPI(u8 cmd);

/*=============================================================================================
** @Name      : void TacSetAuxRackLightCmdAPI(u8 cmd)
** @Input     : void
** @Output    : 电池柜照明用户控制命令( 0:自动控制 1:手动开启   2:手动关闭)
** @Function  : 设置电池柜照明用户强制控制命令
** @The notes : IMEU2控制
**===========================================================================================*/
void TacSetAuxRackLightCmdAPI(u8 cmd);

/*=============================================================================================
** @Name      : void TacSetAuxZHSAForceCmdAPI(u8 cmd)
** @Input     : void
** @Output    : 声光报警器用户控制命令( 0:自动控制 1:强制开启 2:强制关闭)
** @Function  : 设置声光报警器用户强制控制命令
** @The notes : IMEU2控制
**===========================================================================================*/
void TacSetAuxZHSAForceCmdAPI(u8 cmd);

/*=============================================================================================
** @Name      : void TacSetAuxFireTrigCmdAPI(u8 cmd)
** @Input     : void
** @Output    : 气溶胶消防器用户触发命令( 0:自动触发 1:手动触发)
** @Function  : 设置气溶胶消防器用户触发命令
** @The notes : IMEU2控制
**===========================================================================================*/
void TacSetAuxFireTrigCmdAPI(u8 cmd);

/*=============================================================================================
** @Name      : u8 TacGetAuxDevAirTypeAPI(void)
** @Input     : void
** @Output    : 电池柜空调类型:0黑盾 1同飞
** @Function  : 获取空调类型
** @The notes : IMEU2控制设备
**===========================================================================================*/
u8 TacGetAuxDevAirTypeAPI(void);

/*=============================================================================================
** @Name      : u8 TacGetPwmFanCtrlDutyAPI(u8 id)
** @Input     : id:[0,15]:风扇ID(电池箱序号)
** @Output    : 当前控制转速占空比[0,100]1%
** @Function  : 获取电池箱调速风扇当前控制转速占空比
** @The notes : 1个电池箱1路风扇(IMLU1控制)
**===========================================================================================*/
u8 TacGetPwmFanCtrlDutyAPI(u8 id);

/*=================================================================================================
** @Name      : u16 TacGetPwmFanErrFlagAPI(void)
** @Input     : void
** @Output    : 调速风扇回检异常标志(按bit位表示1路电池箱风扇,非风扇通道号)
** @Function  : 获取电池箱调速风扇回检异常标志
** @The notes : 1个电池箱1路风扇,与电池箱连续序号对应(IMLU1控制)
**===============================================================================================*/
u16 TacGetPwmFanErrFlagAPI(void);

/*=============================================================================================
** @Name      : u16 TacGetAuxDevErrFlagAPI(void)
** @Input     : void
** @Output    : 辅助设备异常标志(bit0:开启百叶异常 bit1:开启风机异常 bit2:空调告警 bit8:关闭百叶异常 bit9:关闭风机异常 bit10:空调通信中断)
** @Function  : 获取辅助设备异常标志
** @The notes : IMEU2控制设备
**===========================================================================================*/
u16 TacGetAuxDevErrFlagAPI(void);

/*=============================================================================================
** @Name      : u8 TacGetAuxComErrFlagAPI(void)
** @Input     : void
** @Output    : 辅助设备通信异常标志 bit0:空调 bit1:温湿度传感器1 bit2:温湿度传感器1 bit3:温湿度传感器 bit4:气体传感器1 bit5:气体传感器2 bit6:气体传感器3
** @Function  : 获取辅助设备通讯异常标志
** @The notes : IMEU2控制设备
**===========================================================================================*/
u8 TacGetAuxComErrFlagAPI(void);

#endif

